In [1]:
# This is a test block
print('Test')

Test

In [2]:
# import statements
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({
   'A': ['alpha', 'apple', 'arsenic', 'angel', 'android'],
   'B': [1, 2, 3, 4, 5],
   'C': ['coconut', 'curse', 'cassava', 'cuckoo', 'clarinet'],
   'D': [6, 7, 8, 9, 10]
   },
   index=['row_0', 'row_1', 'row_2', 'row_3', 'row_4'])
df

             A  B         C   D
row_0    alpha  1   coconut   6
row_1    apple  2     curse   7
row_2  arsenic  3   cassava   8
row_3    angel  4    cuckoo   9
row_4  android  5  clarinet  10

In [4]:
df.loc[['row_1']]

           A  B      C  D
row_1  apple  2  curse  7

In [5]:
df.loc[['row_2', 'row_4']]

             A  B         C   D
row_2  arsenic  3   cassava   8
row_4  android  5  clarinet  10

In [6]:
df.iloc[[2, 4]]

             A  B         C   D
row_2  arsenic  3   cassava   8
row_4  android  5  clarinet  10

In [7]:
df[['C']]

              C
row_0   coconut
row_1     curse
row_2   cassava
row_3    cuckoo
row_4  clarinet

In [8]:
# Dot notation
df.C

row_0     coconut
row_1       curse
row_2     cassava
row_3      cuckoo
row_4    clarinet
Name: C, dtype: object

In [9]:
# loc[] notation
df.loc[:, ['C', 'D']]

              C   D
row_0   coconut   6
row_1     curse   7
row_2   cassava   8
row_3    cuckoo   9
row_4  clarinet  10

In [10]:
data = {'planet': ['Mercury', 'Venus', 'Earth', 'Mars',
                   'Jupiter', 'Saturn', 'Uranus', 'Neptune'],
       'radius_km': [2440, 6052, 6371, 3390, 69911, 58232,
                     25362, 24622],
       'moons': [0, 0, 1, 2, 80, 83, 27, 14]
        }
df = pd.DataFrame(data)
df

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
4  Jupiter      69911     80
5   Saturn      58232     83
6   Uranus      25362     27
7  Neptune      24622     14

In [11]:
print(df['moons'] < 20)

0     True
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: moons, dtype: bool

In [12]:
print(df[df['moons'] < 20])

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
7  Neptune      24622     14

In [13]:
mask = df['moons'] < 20
df[mask]

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
7  Neptune      24622     14

In [14]:
df

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
4  Jupiter      69911     80
5   Saturn      58232     83
6   Uranus      25362     27
7  Neptune      24622     14

In [15]:
# The results of the comparison can be assigned to a new variable
mask = df['moons'] < 20
df2 = df[mask]
df2

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
7  Neptune      24622     14

In [18]:
# with this assignment we can now modify the new DataFrame for example selecting just the planet
#df2[['planet']]
mask = df['moons'] < 20
df.loc[mask, ['planet']]

    planet
0  Mercury
1    Venus
2    Earth
3     Mars
7  Neptune

In [21]:
mask = (df['moons'] < 10) | (df['moons'] > 50)
df[mask]

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
4  Jupiter      69911     80
5   Saturn      58232     83

In [22]:
mask = (df['moons'] > 20) & ~(df['moons'] == 80) & ~(df['radius_km'] < 50000)
df[mask]

   planet  radius_km  moons
5  Saturn      58232     83